<style type="text/css">
div.xoopsCode {
	color: #000000;
    background: #F0F0F0;
    font-weight: normal;
    border: 1px inset #000080;
    font-family: "Courier New",Courier,monospace;
    margin : 2px 0px 0px 20px;
    padding: 2px 5px 2px 5px;
	width: 600px;
	height: auto;
	overflow: none;
    text-align: left;
}
ul {list-style: square inside;}
</style>

<h1 align="center">ChatBot 1.0</h1>  <div align="center">Bienvenue dans Chatbot, le module de chat robotis&eacute; pour votre site Xoops.</div><div align="center">Ce module est bas&eacute; sur deux scripts en Javascripts qui simulent la conversation humaine, et donc une forme d&#39;intelligence artificielle (IA). </div><p><u><strong><br /></strong></u></p> <div align="left"><u><strong>Fonctionnalit&eacute;s propos&eacute;es</strong></u><strong> :</strong></div> <ul><li>Nombre illimit&eacute; de chatbot, disposant chacun d&#39;expressions et d&#39;un visuel personnalis&eacute;es (couleurs, images, etc.) et visible en fonction des groupes d&#39;appartenance des utilisateurs.<br /></li><li>Nombre illimit&eacute; de sujets de conversation, que l&#39;on peut affecter au bot de son choix.</li><li>Nombre illimit&eacute; de question/r&eacute;ponses avec mots cl&eacute;s.  Script Akali.</li><li>Nombre illimit&eacute; de question/r&eacute;ponses avec syst&egrave;me de cache. Skript ElizaBot.</li><li>Syst&egrave;me de rapport de discussion soumis par les utilisateurs pour adapter les questions r&eacute;ponses des bots.</li></ul><br /> <div align="left"><u><strong>Instructions</strong></u><strong> :</strong> <br /> </div> <br /><ul><li>Cr&eacute;ez votre bot. Compl&eacute;tez les informations n&eacute;cessaires, et ajoutez les phrase personnalis&eacute;es.</li><ul><li><strong>  Nom</strong> : nom du bot</li><li><strong>Description </strong>:description du bot. S&#39;affichera dans le bloc &eacute;tendu, la page d&#39;index et la page du bot.</li><li><strong>Avatar </strong>: image repr&eacute;sentant le bot. Stocker l&#39;image dans le r&eacute;pertoire d&eacute;fini dessous.</li><li><strong>R&eacute;pertoire </strong>: contient toutes les donn&eacute;es reltives au bot. Le r&eacute;pertoire ainsi s&eacute;lectionn&eacute; doit &ecirc;tre ouvert en &eacute;criture afin de permettre la mise &agrave; jour des donn&eacute;es relatives au bot.</li><li><strong>Images de fond</strong> : nom des images employ&eacute;e pour l&#39;affichage des bots. 2 images : image de la page d&#39;index et image en fond d&#39;&eacute;cran de la bo&icirc;te de dialogue. S&#39;&eacute;crit de la fa&ccedil;on suivante : index_bkg.png<strong>|</strong>textbox_bkg.png</li><li><strong>Couleurs </strong>: couleurs employ&eacute;es sur la page du bot. S&#39;&eacute;crit de la fa&ccedil;on suivante :<font color="red"> Texte de la page</font>|<font color="blue">Fond de page|</font><font color="red">Texte bo&icirc;te de dialogue</font>|<font color="blue">Fond de bo&icirc;te de dialogue</font>|<font color="#006600">Epaisseur du cadre</font></li><li><strong>Phrase d&#39;accueil</strong> : chaque fois que le bot est activ&eacute;, il affiche l&#39;une des phrases choisie au hasard. S&eacute;parer chaque phrase par un |.</li><li><strong>Phrase personnalis&eacute;e</strong> : Indiquez ici quelques expressions types du bot. Ces expressions s&#39;afficheront de fa&ccedil;on al&eacute;toire lorsque le bot voudra changer de sujet de conversation.</li><li><strong>Phrase d&#39;incompr&eacute;hension </strong>: Indiquez ici quelques r&eacute;ponses d&#39;&eacute;tonnement lorsque l&#39;utilisateur se contente de valider des r&eacute;ponses vides.</li><li><strong>Phrase de conclusion </strong>: Lorsque le bot arrive &agrave; bout d&#39;argument sur un th&egrave;me de discussion, il afficher l&#39;une des phrases indiqu&eacute;e ici.</li><li><strong>Groupes </strong>:Permission d&#39;acc&egrave;s par groupe. D&eacute;termine quels utilisateur ont acc&egrave;s au bot.</li><li><strong>Sujet de conversation </strong>: S&eacute;lectionnez ici les sujets de conversation que ma&icirc;trise le bot. Voir plus bas pour les 4 modes d&#39;utilisation disponibles.<br /><em><strong>Astuce : </strong></em>N&#39;oubliez pas d&#39;&eacute;diter votre bot et d&#39;ajouter les th&egrave;mes de discussion que vous auriez cr&eacute;&eacute; ult&eacute;rieurement !<br /><br /> </li></ul><li>D&eacute;poser les images dans le r&eacute;pertoire indiqu&eacute; dans le profile du bot.<br />     <br /> </li><li>Cr&eacute;er les sujets de conversations. 4 modes possibles</li><ul><li><strong>Actif </strong>: sujet list&eacute; dans le profile du bot</li><li><strong>Masqu&eacute; </strong>: sujet utilis&eacute; par le bot, mais non list&eacute; dans son profile</li><li><strong>Contextuel </strong>: utilis&eacute; avec le bloc. La conversation est activ&eacute;e en fonction de la navigation sur le site.</li><li><strong>Inactif </strong>: le sujet est d&eacute;sactiv&eacute; et ignor&eacute; par le bot.<br />       <br /> </li></ul><li>Cr&eacute;er les question/r&eacute;ponse : Q/R Akali.<br /> Bas&eacute; sur un syst&egrave;me de calcul de points en fonction des occurences de mots cl&eacute;s, le bot renverra la r&eacute;ponse ad&eacute;quate en fonction des questions pos&eacute;es.  </li><ul><li>Choisir un sujet de discussion auquel la question/r&eacute;ponse sera affect&eacute;e.</li><li><strong>Obligatoire</strong> : liste des mots cl&eacute;s obligatoires pour activer la r&eacute;ponse. Un seul terme correpondant activera la r&eacute;ponse.</li><li><strong>Facultatif </strong>: liste des mots cl&eacute;s facultatifs pour induire une r&eacute;ponse. Un terme correspondant favorisera la r&eacute;ponse.</li><li><strong>Contextuel </strong>: liste des mots cl&eacute;s pour lier des r&eacute;ponses entre-elles. Si aucun mot cl&eacute; obligatoire n&#39;est d&eacute;tect&eacute; dans la r&eacute;ponse, il poursuit la conversation sur un th&egrave;me &eacute;quivalent.</li><li><strong>R&eacute;ponses </strong>: R&eacute;ponses fournies obligatoirement si l&#39;un des mots cl&eacute;s est activ&eacute;. A employer avec mots cl&eacute;s uniquement. <br /> </li><li><strong>Discussion </strong>: R&eacute;ponses fournies &agrave; une question pr&eacute;cise, ou si aucun terme n&#39;est d&eacute;tect&eacute; afin de relancer la discussion sur un autre sujet. Peut s&#39;employer avec ou sans mots cl&eacute;s.<br /><br /></li></ul><li>Cr&eacute;er les question/r&eacute;ponse : Q/R Eliza.<br /> Ces questions r&eacute;ponses sont automatiquement affect&eacute;es &agrave; tous les bots. Le script se base sur la m&eacute;thode &#39;Eliza&#39;, c&#39;est &agrave; dire quelle renvoie &agrave; l&#39;utilisateur des r&eacute;ponses bas&eacute;es ou incluant les mots cl&eacute;s rep&eacute;r&eacute;es dans la question de l&#39;utilisateur. Ce script fonctionne sur base d&#39;un syst&egrave;me de masque et peut &ecirc;tre employ&eacute; pour &eacute;luder les questions trop personnelles. </li><ul><li><strong>Questions </strong>: liste des masques &agrave; appliquer aux questions de l&#39;utilisateur.</li><li><strong>R&eacute;ponses</strong>: liste des r&eacute;ponses potentielles, choisies de fa&ccedil;on al&eacute;atoire. Utiliser $1 pour afficher les termes repris dans le masque de la question.</li></ul></ul><p><u><strong>Les bonus</strong></u><strong> :</strong>&nbsp;</p><ul><li>&nbsp;<strong>Les &eacute;moticones</strong><br />Pour activer les &eacute;motic&ocirc;nes ou plus simplement afficher une image diff&eacute;rente en fonction de la r&eacute;ponse du bot, nommez vos images au format .gif en fonction des mots cl&eacute;s pour lesquels ils doivent s&#39;activer et d&eacute;posez simplement les dans le r&eacute;pertoire de stockage du bot. <br />Exemple : <em><strong>conduire.gif </strong></em>s&#39;affichera lorsque le bot dire : &quot;J&#39;aime <em><strong>conduire</strong></em>.&quot;<br /><br /></li><li><strong>Infos du site</strong><br /> Dans les pr&eacute;f&eacute;rences du module, vous trouverez un champ &quot;Info du site&quot;. Ce champ permet d&#39;aller r&eacute;cup&eacute;rer des informations dans la base de donn&eacute;e du site en cours et d&#39;en appeler le r&eacute;sultat en fonction de mots cl&eacute;s d&eacute;finis. <br />La formule employ&eacute;e est la suivante : <span style="font-weight: normal"><strong>MOTS CLES,TABLE,COLUMN,WHERE</strong>. Veillez &agrave; s&eacute;parer chaque terme par une virgule.</span><br /><ul><li>Exemple 1 : <strong>chatbots chatbot nom,chatbot_bot,bot_name,status=1</strong> affichera le nom des bots actifs du module lorsque l&#39;utilsateur entrera la question : &quot;Quel est le <strong>nom </strong>des <strong>chatbots </strong>actifs de ce site ?&quot;</li></ul><ul><li> Exemple 2 : <strong>chatbots Combien combien,chatbot_bot,count(*),status=1</strong> affichera le nombre de bots actifs du module lorsque l&#39;utilsateur entrera la question : &quot;<strong>Combien</strong> de <strong>chatbots </strong>sont actifs sur ce site ?&quot;.<br /><br />Astuces : le premier mot cl&eacute; est employ&eacute; dans la r&eacute;ponse fournie. N&#39;importe quelle table de la base de donn&eacute;e du site peut ainsi &ecirc;tre consult&eacute;e, en ce compris les autres modules.&nbsp; </li></ul> </li></ul>

